# Analyses in R Final Project

### load packages

In [1]:
library("dplyr")
library("car")
library("rcompanion")
library("IDPmisc")

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union


Warning message:
"package 'car' was built under R version 4.1.3"
Loading required package: carData

Warning message:
"package 'carData' was built under R version 4.1.3"

Attaching package: 'car'


The following object is masked from 'package:dplyr':

    recode


Warning message:
"package 'rcompanion' was built under R version 4.1.3"

In [2]:
apps = read.csv('../Data/application_record.csv')

# Data Wrangling

In [3]:
# rename columns
names(apps)[names(apps) == "CODE_GENDER"] <- "gender"
names(apps)[names(apps) == "FLAG_OWN_CAR"] <- "ownsCar"
names(apps)[names(apps) == "FLAG_OWN_REALTY"] <- "ownsRealty"
names(apps)[names(apps) == "NAME_INCOME_TYPE"] <- "incomeType"
names(apps)[names(apps) == "OCCUPATION_TYPE"] <- "occupation"
names(apps)[names(apps) == "NAME_HOUSING_TYPE"] <- "housingType"
names(apps)[names(apps) == "NAME_EDUCATION_TYPE"] <- "eduLvl"
names(apps)[names(apps) == "NAME_FAMILY_STATUS"] <- "famStatus"
names(apps)[names(apps) == "CNT_CHILDREN"] <- "numChildren"
names(apps)[names(apps) == "AMT_INCOME_TOTAL"] <- "totalIncome"
names(apps)[names(apps) == "DAYS_BIRTH"] <- "daysBirth"
names(apps)[names(apps) == "DAYS_EMPLOYED"] <- "daysEmpl"
names(apps)[names(apps) == "CNT_FAM_MEMBERS"] <- "famSize"

In [4]:
head(apps)

  ID      gender ownsCar ownsRealty numChildren totalIncome
1 5008804 M      Y       Y          0           427500
2 5008805 M      Y       Y          0           427500
3 5008806 M      Y       Y          0           112500
4 5008808 F      N       Y          0           270000
5 5008809 F      N       Y          0           270000
6 5008810 F      N       Y          0           270000
  incomeType           eduLvl                        famStatus
1 Working              Higher education              Civil marriage
2 Working              Higher education              Civil marriage
3 Working              Secondary / secondary special Married
4 Commercial associate Secondary / secondary special Single / not married
5 Commercial associate Secondary / secondary special Single / not married
6 Commercial associate Secondary / secondary special Single / not married
  housingType       daysBirth daysEmpl FLAG_MOBIL FLAG_WORK_PHONE FLAG_PHONE
1 Rented apartment  -12005    -4542    1          1               0
2 Rented apartment  -12005    -4542    1          1               0
3 House / apartment -21474    -1134    1          0               0
4 House / apartment -19110    -3051    1          0               1
5 House / apartment -19110    -3051    1          0               1
6 House / apartment -19110    -3051    1          0               1
  FLAG_EMAIL occupation     famSize
1 0                         2
2 0                         2
3 0          Security staff 2
4 1          Sales staff    1
5 1          Sales staff    1
6 1          Sales staff    1

In [11]:
# subset to only include variables of interest
apps2 <- apps[-c(13:16)]

In [12]:
head(apps2)

  ID      gender ownsCar ownsRealty numChildren totalIncome
1 5008804 M      Y       Y          0           427500
2 5008805 M      Y       Y          0           427500
3 5008806 M      Y       Y          0           112500
4 5008808 F      N       Y          0           270000
5 5008809 F      N       Y          0           270000
6 5008810 F      N       Y          0           270000
  incomeType           eduLvl                        famStatus
1 Working              Higher education              Civil marriage
2 Working              Higher education              Civil marriage
3 Working              Secondary / secondary special Married
4 Commercial associate Secondary / secondary special Single / not married
5 Commercial associate Secondary / secondary special Single / not married
6 Commercial associate Secondary / secondary special Single / not married
  housingType       daysBirth daysEmpl occupation     famSize
1 Rented apartment  -12005    -4542                   2
2 Rented apartment  -12005    -4542                   2
3 House / apartment -21474    -1134    Security staff 2
4 House / apartment -19110    -3051    Sales staff    1
5 House / apartment -19110    -3051    Sales staff    1
6 House / apartment -19110    -3051    Sales staff    1

In [13]:
# omit missing values
apps2 <- na.omit(apps2)

In [14]:
head(apps2)

  ID      gender ownsCar ownsRealty numChildren totalIncome
1 5008804 M      Y       Y          0           427500
2 5008805 M      Y       Y          0           427500
3 5008806 M      Y       Y          0           112500
4 5008808 F      N       Y          0           270000
5 5008809 F      N       Y          0           270000
6 5008810 F      N       Y          0           270000
  incomeType           eduLvl                        famStatus
1 Working              Higher education              Civil marriage
2 Working              Higher education              Civil marriage
3 Working              Secondary / secondary special Married
4 Commercial associate Secondary / secondary special Single / not married
5 Commercial associate Secondary / secondary special Single / not married
6 Commercial associate Secondary / secondary special Single / not married
  housingType       daysBirth daysEmpl occupation     famSize
1 Rented apartment  -12005    -4542                   2
2 Rented apartment  -12005    -4542                   2
3 House / apartment -21474    -1134    Security staff 2
4 House / apartment -19110    -3051    Sales staff    1
5 House / apartment -19110    -3051    Sales staff    1
6 House / apartment -19110    -3051    Sales staff    1

In [ ]:
duplicated(apps2)

In [15]:
#remove duplicate rows across entire data frame
apps3 <- apps2[!duplicated(apps2), ]

In [16]:
head(apps3)

  ID      gender ownsCar ownsRealty numChildren totalIncome
1 5008804 M      Y       Y          0           427500
2 5008805 M      Y       Y          0           427500
3 5008806 M      Y       Y          0           112500
4 5008808 F      N       Y          0           270000
5 5008809 F      N       Y          0           270000
6 5008810 F      N       Y          0           270000
  incomeType           eduLvl                        famStatus
1 Working              Higher education              Civil marriage
2 Working              Higher education              Civil marriage
3 Working              Secondary / secondary special Married
4 Commercial associate Secondary / secondary special Single / not married
5 Commercial associate Secondary / secondary special Single / not married
6 Commercial associate Secondary / secondary special Single / not married
  housingType       daysBirth daysEmpl occupation     famSize
1 Rented apartment  -12005    -4542                   2
2 Rented apartment  -12005    -4542                   2
3 House / apartment -21474    -1134    Security staff 2
4 House / apartment -19110    -3051    Sales staff    1
5 House / apartment -19110    -3051    Sales staff    1
6 House / apartment -19110    -3051    Sales staff    1

# One Way Between Subjects ANOVA

In [ ]:
# Is there a difference in income among all categories of occupation type?

In [ ]:
# Normality of the DV (totalIncome)
plotNormalHistogram(apps3$AMT_INCOME_TOTAL)

In [ ]:
# try sqrt due to slight positive skew
apps3$AMT_INCOME_TOTALSQRT <- sqrt(apps3$AMT_INCOME_TOTAL)

In [ ]:
plotNormalHistogram(apps3$AMT_INCOME_TOTALSQRT)

In [ ]:
# homogeneity of variance - bartlett's test
bartlett.test(AMT_INCOME_TOTALSQRT~OCCUPATION_TYPE, data = apps3)

In [ ]:
## Since p val is <.05, this assumption fails.

In [ ]:
# Is there a difference in income among all categories of family status type?

In [ ]:
unique(apps3$NAME_FAMILY_STATUS)

In [ ]:
# homogeneity of variance - bartlett's test
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_FAMILY_STATUS, data = apps3)

In [ ]:
# Is there a difference in income among all categories of HOUSING type?

In [ ]:
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_HOUSING_TYPE, data = apps3)

In [ ]:
# Is there a difference in income among all categories of EDUCATION type?

In [ ]:
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_EDUCATION_TYPE, data = apps2)

In [ ]:
# Is there a difference in income among all categories of INCOME type?

In [ ]:
bartlett.test(AMT_INCOME_TOTALSQRT~NAME_INCOME_TYPE, data = apps2)

### the DV (total income) has a normal distribution, but none of the categorical variables in this dataset pass the assumption of homogeneity as it pertains to total income.  Therefore, ANOVAs and MANOVAs cannot be followed through with with the expectations of receiving accurate conclusions.

In [ ]:
#